In [ ]:
#Importing libraries

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
#Uploading data set

In [4]:
data=pd.read_csv(r"C:\Users\100774\Downloads\StudentsPerformance (1).csv")

In [5]:
data

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group C,some high school,free/reduced,none,0,17,10
1,female,group B,high school,free/reduced,none,8,24,23
2,female,group B,some high school,free/reduced,none,18,32,28
3,female,group B,some college,standard,none,11,38,32
4,female,group C,some college,free/reduced,none,22,39,33
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [7]:
data.shape

(1000, 8)

In [9]:
data.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

In [34]:
data.describe()

        math score  reading score  writing score
count  1000.000000    1000.000000    1000.000000
mean     66.001000      69.195000      68.119000
std      15.569567      14.706436      15.226381
min       0.000000      17.000000      10.000000
25%      57.000000      59.000000      58.000000
50%      66.000000      70.000000      69.000000
75%      77.000000      79.250000      79.000000
max     100.000000     100.000000     100.000000

In [ ]:
#Q1). finding how many males and females participated in the test

In [35]:
data['gender'].value_counts()

gender
female    518
male      482
Name: count, dtype: int64

In [ ]:
#Analysis: Female participants are more on this survey

In [ ]:
#Q2). Taking the count of parental level of education

In [36]:
data['parental level of education'].value_counts()

parental level of education
some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: count, dtype: int64

In [ ]:
#Analysis: Majority of the parents had done their graduation

In [ ]:
#Q3) finding who scores most on average for math reading and writing based on gender

In [37]:
data[['gender','math score','reading score','writing score']].groupby('gender').mean()

        math score  reading score  writing score
gender
female   63.376448      72.590734      72.467181
male     68.821577      65.545643      63.446058

In [ ]:
#Analysis: Female scores most on average for maths reading and writing scores.

In [ ]:
#Q3) finding who scores most on average for math reading and writing based on test preparation coarse

In [38]:
data[['test preparation course','math score','reading score','writing score']].groupby('test preparation course').mean()

                         math score  reading score  writing score
test preparation course
completed                  69.96648      74.175978      74.684358
none                       63.78972      66.417445      64.457944

In [ ]:
#Analysis: Students who completed test preparation course score more that who didnt complete.

In [ ]:
#Q4.a) finding tha scoring variation for maths based on gender

In [32]:
data[['gender','math score','reading score','writing score']].groupby('gender').var()

        math score  reading score  writing score
gender
female  256.958593     207.677438     220.369327
male    211.889097     200.211010     202.413924

In [ ]:
#Analysis: Scoring variation is more for females than males.

In [ ]:
#Q4.b) finding tha scoring variation for maths based on test preparation course.

In [33]:
data[['test preparation course','math score','reading score','writing score']].groupby('test preparation course').var()

                         math score  reading score  writing score
test preparation course
completed                210.884027     183.265864     175.202612
none                     246.668662     213.419851     226.251739

In [ ]:
#Analysis: Scoring variation is more for those who completed the test preparation course.

In [ ]:
#Q5). Top 25% of students based on their math score.

In [20]:
percentile_score = np.percentile(data["math score"], 75)

In [21]:
percentile_score

77.0

In [ ]:
#Analysis: There is 25% of the students scored 77 or greater than on the math test.

In [22]:
top_performers = data[data["math score"] >= percentile_score]

In [23]:
top_performers

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
414,female,group A,high school,free/reduced,completed,77,88,85
415,female,group B,master's degree,free/reduced,completed,77,97,94
416,female,group B,bachelor's degree,free/reduced,none,77,85,87
417,female,group B,master's degree,standard,none,77,90,84
418,female,group B,high school,standard,completed,77,82,89
...,...,...,...,...,...,...,...,...
995,male,group E,some college,standard,completed,99,87,81
996,male,group A,some college,standard,completed,100,96,86
997,male,group D,some college,standard,completed,100,97,99
998,male,group E,associate's degree,free/reduced,completed,100,100,93
999,male,group E,bachelor's degree,standard,completed,100,100,100

In [ ]:
#Analysis: There is 255 students scored 77 or greater than on the math test.